[
  {
    "name":"Mercury ",
    "img":"https://www.hindustantimes.com/ht-img/img/2023/09/12/1600x900/Instagram_Viral_Mercury_Solar_System_NASA_1694528417077_1694528432890.jfif",
    "detail":"It’s the nearest planet to the sun and is also the smallest planet in the solar system and takes around 88 days to complete one revolution (to be exact 88.97 days) which is the smallest time duration. \nIts size is slightly larger than the size of the moon of earth. It does not have many moons and climatic conditions that are not favorable for any form of life as it is too near to the Sun. Its surface temperature ranges from 100 K at night to 700 K during the day (this high diurnal range of temperature is there because the planet has no atmosphere to retain and this is the highest among all planets).\n It’s the second densest planet in our solar system with the smallest tilt in its axis among all the planets in the solar system."
  },
  {
    "name":"Venus",
    "img":"https://fox5sandiego.com/wp-content/uploads/sites/15/2023/06/AdobeStock_58627825-1.jpeg?w=2560&h=1440&crop=1",
    "detail":"When observed from the Earth, it’s the second brightest (after the observed moon) and takes 224.7 Earth days to complete one revolution and 243 Earth days for rotation on its axis (it takes the maximum time period among all planets to complete one rotation). It rotates in the opposite direction to all planets except Uranus (from West to East).\n It’s also observed that one day on Venus is equal to one year on Earth. It’s also called Earth’s twin sister because of its similar size, shape, mass, and proximity to the sun and of its bulky composition. It’s not suitable for human settlement because it contains 96% carbon in the atmosphere. The surface temperature is very high (a mean temperature of 735K), making it the warmest planet in our solar system."
  },
  {
    "name": "Earth",
    "img": "https://cdn.mos.cms.futurecdn.net/4fciRAREfw8LiU3BVJuhxB.jpg",
    "detail": "It’s the third planet from the Sun and is the only known planet to harbour life. The Earth's age is around 4.5 billion years old. It takes 365.264 days to complete one revolution around the Sun and 24 hours to complete one rotation on its axis (and after every four complete revolutions 4years it takes a day longer 366 days to complete a revolution). It is covered by 71% of water and its crust is divided into different tectonic plates (lithosphere). Earth’s innermost part remains active and its inner core is solid while the outer core is liquid which generates Earth's magnetic field."
  },
  {
    "name":"Mars",
    "img":"https://starwalk.space/gallery/images/mars-the-ultimate-guide/1920x1080.jpg",
    "detail":"It’s the fourth planet from the sun and also the second-smallest in the solar system. Its red colour also makes it known as the red planet (presence of iron oxide). It has two moons - Phobos and Deimos. Its gravity is 38% of the Earth's gravity and takes 687 Earth's day and one full Mars year (16,500 hours)."
  },
  {
    "name":"Jupiter",
    "img":"https://cdn.mos.cms.futurecdn.net/CEcNsyxi5EoxdsmxNawzEk-1200-80.jpg",
    "detail":"It’s the fifth planet from the Sun and the largest planet among all. It’s also one of the brightest things that can be seen in the sky with the naked eye.Jupiter is a giant ball of gases with a one-thousand mass of the Sun and lacks a well-defined surface. "
  },
  {
    "name":"Saturn",
    "img":"https://t4.ftcdn.net/jpg/03/37/10/25/360_F_337102531_Mdf6uRexAN4MPF2JcQwTAvJeHmaqc5Np.jpg",
    "detail":"It’s the sixth planet from the Sun and the second-largest planet in the solar system. It’s a giant gas planet with an average radius that is nine times the radius of the earth. The inner core is made of iron and nickel. An electric current within the hydrogen layer gives rise to the magnetic field of Saturn which is a little less than the earth's magnetic field."
  },
  {
    "name":"Uranus",
    "img":"https://hips.hearstapps.com/hmg-prod/images/uranus-1585338466.jpg?crop=1xw:1xh;center,top&resize=1200:*",
    "detail":"It’s the seventh planet from the Sun and has the fourth-largest planet by mass and third-largest by radius. It's also referred to as ice giant and its primary component is similar to Jupiter and Saturn but it also has more ices such as methane, water, and ammonia and also traces of hydrocarbons. It rotates in the opposite direction from all the planets except venus( it rotates from west to east)."
  },
  {
    "name":"Neptune",
    "img":"https://images.alphacoders.com/134/thumb-1920-1345679.png",
    "detail":"It’s the eighth planet from the Sun. It’s the fourth-largest planet by diameter. The third most massive planet and is the densest giant planet - it’s slightly larger than Uranus and Neptune. It orbits the Sun every 164.8 years and is denser than Uranus and physically smaller than Uranus."
  }
]